#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.iam_role.data.aws_iam_openid_connect_provider.gha: Reading...
module.iam_role.data.aws_iam_openid_connect_provider.gha: Read complete after 0s [id=arn:aws:iam::226259849760:oidc-provider/token.actions.githubusercontent.com]
module.iam_role.data.aws_iam_policy_document.gha: Reading...
module.iam_role.data.aws_iam_policy_document.gha: Read complete after 0s [id=847581730]
module.iam_role.aws_iam_role.gha: Refreshing state... [id=gha-amplify-next-role]
module.iam_role.aws_iam_role_policy_attachment.gha_secrets: Refreshing state... [id=gha-amplify-next-role-20250517022721550600000001]
module.iam_role.aws_iam_role_policy_attachment.gha_amplify: Refreshing state... [id=gha-amplify-next-role-20250517022913183400000001]
module.iam_role.aws_iam_role_policy_attachment.gha_logs: Refreshing state... [id=gha-amplify-next-role-20250517022913218100000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.amplify-next-sample.data.aws_secretsmanager_secret_version.amplify_credentials will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "amplify_credentials" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.amplify-next-sample.aws_amplify_app.this will be created
  + resource "aws_amplify_app" "this" {
      + access_token                = (sensitive value)
      + arn                         = (known after apply)
      + build_spec                  = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - eval "$(ssh-agent -s)"
                    - ssh-add <(echo "$SSH_PRIVATE_KEY" | base64 -d)
                    - touch ~/.ssh/config
                    - 'echo -e "Host *\n\tStrictHostKeyChecking no\n\n" > ~/.ssh/config'
                    - ssh-keyscan -H github.com >> ~/.ssh/known_hosts
                build:
                  commands:
                    - nvm use 18
                    - npm run updateModules:ci
                    - npm run build
              artifacts:
                baseDirectory: .next
                files:
                  - "**/*"
              cache:
                paths:
                  - node_modules/**/*
        EOT
      + custom_headers              = (known after apply)
      + default_domain              = (known after apply)
      + enable_auto_branch_creation = false
      + enable_basic_auth           = false
      + enable_branch_auto_build    = true
      + enable_branch_auto_deletion = false
      + environment_variables       = (known after apply)
      + id                          = (known after apply)
      + name                        = "amplify-next"
      + platform                    = "WEB_COMPUTE"
      + production_branch           = (known after apply)
      + repository                  = "https://github.com/arie0703/sandbox-next"
      + tags_all                    = (known after apply)

      + auto_branch_creation_config (known after apply)

      + cache_config (known after apply)
    }

  # module.amplify-next-sample.aws_cloudwatch_log_group.amplify will be created
  + resource "aws_cloudwatch_log_group" "amplify" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.amplify-next-sample.aws_secretsmanager_secret.amplify_credentials will be created
  + resource "aws_secretsmanager_secret" "amplify_credentials" {
      + arn                            = (known after apply)
      + description                    = "amplify-next-sample credentials"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "amplify-next-sample-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.iam_role.aws_iam_role.gha will be updated in-place
  ~ resource "aws_iam_role" "gha" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:arie0703/*" -> "repo:arie0703/terraform-resources/*"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "gha-amplify-next-role"
        name                  = "gha-amplify-next-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @arie0703, Action: `pull_request`, Working Directory: `services/amplify-next`, Workflow: `Terraform Plan and Cost Analysis`*